In [3]:
import pandas as pd
import numpy as np
import seaborn as sns
import os
import matplotlib.pyplot as plt

In [12]:
df = pd.read_csv(r'/Users/suneelmeena/LearnBay/csv file/cars.csv')
df

,S.No.,Name,Location,Year,Kilometers_Driven,Fuel_Type,Transmission,Owner_Type,Mileage,KM,Power,MM,New_Price,Price
0,0,Maruti Wagon R LXI CNG,Mumbai,2010,72000,CNG,Manual,First,26.60,km/kg,58.16,bhp,NaN,1.75
1,1,Hyundai Creta 1.6 CRDi SX Option,Pune,2015,41000,Diesel,Manual,First,19.67,kmpl,126.20,bhp,NaN,12.50
2,2,Honda Jazz V,Chennai,2011,46000,Petrol,Manual,First,18.20,kmpl,88.70,bhp,8.61 Lakh,4.50
3,3,Maruti Ertiga VDI,Chennai,2012,87000,Diesel,Manual,First,20.77,kmpl,88.76,bhp,NaN,6.00
4,4,Audi A4 New 2.0 TDI Multitronic,Coimbatore,2013,40670,Diesel,Automatic,Second,15.20,kmpl,140.80,bhp,NaN,17.74
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
7248,7248,Volkswagen Vento Diesel Trendline,Hyderabad,2011,89411,Diesel,Manual,First,20.54,kmpl,103.60,bhp,NaN,NaN
7249,7249,Volkswagen Polo GT TSI,Mumbai,2015,59000,Petrol,Automatic,First,17.21,kmpl,103.60,bhp,NaN,NaN
7250,7250,Nissan Micra Diesel XV,Kolkata,2012,28000,Diesel,Manual,First,23.08,kmpl,63.10,bhp,NaN,NaN
7251,7251,Volkswagen Polo GT TSI,Pune,2013,52262,Petrol,Automatic,Third,17.20,kmpl,103.60,bhp,NaN,NaN
7252,7252,Mercedes-Benz E-Class 2009-2013 E 220 CDI Avan...,Kochi,2014,72443,Diesel,Automatic,First,10.00,kmpl,170.00,bhp,NaN,NaN

In [14]:
df.shape

(7253, 14)

# Display the first 5 rows of the dataset.

In [8]:
df.head()

,S.No.,Name,Location,Year,Kilometers_Driven,Fuel_Type,Transmission,Owner_Type,Mileage,KM,Power,MM,New_Price,Price
0,0,Maruti Wagon R LXI CNG,Mumbai,2010,72000,CNG,Manual,First,26.60,km/kg,58.16,bhp,NaN,1.75
1,1,Hyundai Creta 1.6 CRDi SX Option,Pune,2015,41000,Diesel,Manual,First,19.67,kmpl,126.20,bhp,NaN,12.50
2,2,Honda Jazz V,Chennai,2011,46000,Petrol,Manual,First,18.20,kmpl,88.70,bhp,8.61 Lakh,4.50
3,3,Maruti Ertiga VDI,Chennai,2012,87000,Diesel,Manual,First,20.77,kmpl,88.76,bhp,NaN,6.00
4,4,Audi A4 New 2.0 TDI Multitronic,Coimbatore,2013,40670,Diesel,Automatic,Second,15.20,kmpl,140.80,bhp,NaN,17.74

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7253 entries, 0 to 7252
Data columns (total 14 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   S.No.              7253 non-null   int64
 1   Name               7253 non-null   object
 2   Location           7253 non-null   object
 3   Year               7253 non-null   int64
 4   Kilometers_Driven  7253 non-null   int64
 5   Fuel_Type          7253 non-null   object
 6   Transmission       7253 non-null   object
 7   Owner_Type         7253 non-null   object
 8   Mileage            7251 non-null   float64
 9   KM                 7251 non-null   object
 10  Power              7078 non-null   float64
 11  MM                 7207 non-null   object
 12  New_Price          1006 non-null   object
 13  Price              6019 non-null   float64
dtypes: float64(3), int64(3), object(8)
memory usage: 793.4+ KB

# What is the data type of each column?

In [13]:
df.dtypes

S.No.                  int64
Name                  object
Location              object
Year                   int64
Kilometers_Driven      int64
Fuel_Type             object
Transmission          object
Owner_Type            object
Mileage              float64
KM                    object
Power                float64
MM                    object
New_Price             object
Price                float64
dtype: object

In [15]:
sum(pd.isnull(df['Mileage']))

2

In [17]:
sum(pd.isnull(df['Name']))

0

# Check the number of missing values in each column.

In [20]:
mis_val=df.isna().sum()
mis_val

S.No.                   0
Name                    0
Location                0
Year                    0
Kilometers_Driven       0
Fuel_Type               0
Transmission            0
Owner_Type              0
Mileage                 2
KM                      2
Power                 175
MM                     46
New_Price            6247
Price                1234
dtype: int64

# How many unique car models are there?

In [30]:
df.Name.nunique()

2041

In [34]:
#Which columns have null values, and how would you handle them?
df.columns[df.isna().any()]   # this will give which columns have null values

Index(['Mileage', 'KM', 'Power', 'MM', 'New_Price', 'Price'], dtype='object')

In [36]:
df.isna().sum()

S.No.                   0
Name                    0
Location                0
Year                    0
Kilometers_Driven       0
Fuel_Type               0
Transmission            0
Owner_Type              0
Mileage                 2
KM                      2
Power                 175
MM                     46
New_Price            6247
Price                1234
dtype: int64

In [38]:
df.dropna()     #inorder to handle, with dropna function we can delete all rows in which single nan present

,S.No.,Name,Location,Year,Kilometers_Driven,Fuel_Type,Transmission,Owner_Type,Mileage,KM,Power,MM,New_Price,Price
2,2,Honda Jazz V,Chennai,2011,46000,Petrol,Manual,First,18.20,kmpl,88.70,bhp,8.61 Lakh,4.50
7,7,Toyota Innova Crysta 2.8 GX AT 8S,Mumbai,2016,36000,Diesel,Automatic,First,11.36,kmpl,171.50,bhp,21 Lakh,17.50
10,10,Maruti Ciaz Zeta,Kochi,2018,25692,Petrol,Manual,First,21.56,kmpl,103.25,bhp,10.65 Lakh,9.95
15,15,Mitsubishi Pajero Sport 4X4,Delhi,2014,110000,Diesel,Manual,First,13.50,kmpl,175.56,bhp,32.01 Lakh,15.00
20,20,BMW 3 Series 320d,Kochi,2014,32982,Diesel,Automatic,First,22.69,kmpl,190.00,bhp,47.87 Lakh,18.55
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
5999,5999,Tata Bolt Revotron XT,Chennai,2016,10000,Petrol,Manual,First,17.57,kmpl,88.70,bhp,7.77 Lakh,4.00
6002,6002,Volkswagen Vento 1.6 Highline,Mumbai,2011,38000,Petrol,Manual,First,16.09,kmpl,103.50,bhp,11.91 Lakh,3.25
6005,6005,Maruti Vitara Brezza VDi,Pune,2016,37208,Diesel,Manual,First,24.30,kmpl,88.50,bhp,9.93 Lakh,7.43
6010,6010,Honda Brio 1.2 VX MT,Delhi,2013,33746,Petrol,Manual,First,18.50,kmpl,86.80,bhp,6.63 Lakh,3.20
6014,6014,Maruti Swift VDI,Delhi,2014,27365,Diesel,Manual,First,28.40,kmpl,74.00,bhp,7.88 Lakh,4.75

In [40]:
# or using fillna function we can fill nan value with mean as it is numerical data
df.fillna({"Mileage": df.Mileage.mean()},inplace=True)

In [42]:
df.isna().sum()     # to check missing values are now gone from mileage column

S.No.                   0
Name                    0
Location                0
Year                    0
Kilometers_Driven       0
Fuel_Type               0
Transmission            0
Owner_Type              0
Mileage                 0
KM                      2
Power                 175
MM                     46
New_Price            6247
Price                1234
dtype: int64

In [44]:
df.fillna({"KM":"kmpl"},inplace=True)   # here we are filling nan value with "kmpl" Text value only as it is same for all rows
# like this we can also handle the MM column

In [54]:
# Drop the 'MM' column
df.drop(columns=['MM'], inplace=True)

In [56]:
df.isna().sum()

S.No.                   0
Name                    0
Location                0
Year                    0
Kilometers_Driven       0
Fuel_Type               0
Transmission            0
Owner_Type              0
Mileage                 0
KM                      0
Power                   0
New_Price            6247
Price                1234
dtype: int64

In [58]:
df.fillna({"Power":df.Power.mean()},inplace=True)
df.isna().sum()

S.No.                   0
Name                    0
Location                0
Year                    0
Kilometers_Driven       0
Fuel_Type               0
Transmission            0
Owner_Type              0
Mileage                 0
KM                      0
Power                   0
New_Price            6247
Price                1234
dtype: int64

In [60]:
# here as we can see in New_Price and Price both have such data we cannot do ffill or bbfill and
# even any mean, median,mode operation value hence it is good to use dropna() to delete all rows

In [52]:
# List the top 5 locations with the most cars listed.
top_locations = df['Location'].value_counts().head()
print(top_locations)

Location
Mumbai        949
Hyderabad     876
Coimbatore    772
Kochi         772
Pune          765
Name: count, dtype: int64

In [64]:
# we can do this also
print(df['Location'].value_counts().nlargest(5))

Location
Mumbai        949
Hyderabad     876
Coimbatore    772
Kochi         772
Pune          765
Name: count, dtype: int64

In [293]:
# What is the range (min-max) of car prices?
df.New_Price.dtype  # to check the datatype of new_price

dtype('O')

In [317]:
df.New_Price.unique()

array([nan, '8.61 Lakh', '21 Lakh', '10.65 Lakh', '32.01 Lakh',
       '47.87 Lakh', '10.57 Lakh', '12.33 Lakh', '11.12 Lakh',
       '23.64 Lakh', '18.64 Lakh', '19.34 Lakh', '49.14 Lakh',
       '11.81 Lakh', '16.65 Lakh', '6.67 Lakh', '6.45 Lakh', '6.41 Lakh',
       '27 Lakh', '5.13 Lakh', '54.43 Lakh', '9.51 Lakh', '9.96 Lakh',
       '14.44 Lakh', '4.53 Lakh', '95.04 Lakh', '13.49 Lakh', '1.28 Cr',
       '60.88 Lakh', '7.39 Lakh', '69.47 Lakh', '8.78 Lakh', '12.74 Lakh',
       '10.52 Lakh', '11.98 Lakh', '8.54 Lakh', '33.58 Lakh', '9.12 Lakh',
       '5.29 Lakh', '44.28 Lakh', '20.74 Lakh', '11.74 Lakh',
       '25.52 Lakh', '14.07 Lakh', '95.13 Lakh', '8.34 Lakh', '8.85 Lakh',
       '25.4 Lakh', '16.67 Lakh', '79.43 Lakh', '6.62 Lakh', '1.04 Cr',
       '58.67 Lakh', '28.37 Lakh', '4.48 Lakh', '72.64 Lakh',
       '36.15 Lakh', '44.59 Lakh', '12 Lakh', '14.65 Lakh', '53.72 Lakh',
       '33.91 Lakh', '12.51 Lakh', '9.74 Lakh', '95.38 Lakh',
       '60.59 Lakh', '11.28 Lakh', '11.48 Lakh', '11.26 Lakh',
       '43.65 Lakh', '62.07 Lakh', '86.97 Lakh', '1 Cr', '4.74 Lakh',
       '14.84 Lakh', '49.49 Lakh', '48.18 Lakh', '12.34 Lakh',
       '15.38 Lakh', '19.21 Lakh', '22.95 Lakh', '11.15 Lakh',
       '10.32 Lakh', '28.05 Lakh', '59.77 Lakh', '15.86 Lakh',
       '19.43 Lakh', '42.12 Lakh', '16.95 Lakh', '15.45 Lakh',
       '7.87 Lakh', '4.7 Lakh', '15.02 Lakh', '12.56 Lakh', '11.33 Lakh',
       '26.45 Lakh', '10.34 Lakh', '7.46 Lakh', '11.85 Lakh',
       '10.41 Lakh', '5.57 Lakh', '42.48 Lakh', '16.04 Lakh', '9.1 Lakh',
       '7.65 Lakh', '13.74 Lakh', '5.72 Lakh', '21.33 Lakh', '78.76 Lakh',
       '4.29 Lakh', '10.04 Lakh', '11.67 Lakh', '8.56 Lakh', '4.78 Lakh',
       '6.14 Lakh', '7.3 Lakh', '4.37 Lakh', '4.98 Lakh', '15.29 Lakh',
       '24.26 Lakh', '75.12 Lakh', '9.53 Lakh', '34.6 Lakh', '52.26 Lakh',
       '70.43 Lakh', '4.8 Lakh', '12.12 Lakh', '19.37 Lakh', '12.14 Lakh',
       '36.69 Lakh', '23.68 Lakh', '55.61 Lakh', '14.1 Lakh',
       '13.26 Lakh', '11.27 Lakh', '11.2 Lakh', '9.46 Lakh', '12.79 Lakh',
       '15.57 Lakh', '19.86 Lakh', '6.59 Lakh', '6.54 Lakh', '26.56 Lakh',
       '15.05 Lakh', '11.01 Lakh', '11 Lakh', '7.55 Lakh', '7.82 Lakh',
       '6.32 Lakh', '15.14 Lakh', '15.72 Lakh', '45.67 Lakh', '54.7 Lakh',
       '22.87 Lakh', '6.74 Lakh', '33.09 Lakh', '23.25 Lakh',
       '19.27 Lakh', '52.77 Lakh', '7.92 Lakh', '7.85 Lakh', '15.55 Lakh',
       '32.45 Lakh', '4.83 Lakh', '7.13 Lakh', '71.82 Lakh', '50.97 Lakh',
       '10.73 Lakh', '9.5 Lakh', '52.46 Lakh', '6.07 Lakh', '5.54 Lakh',
       '4.33 Lakh', '8.63 Lakh', '6.68 Lakh', '7.98 Lakh', '24.82 Lakh',
       '7.63 Lakh', '22.86 Lakh', '11.06 Lakh', '19.39 Lakh',
       '21.77 Lakh', '18.35 Lakh', '9.19 Lakh', '8.09 Lakh', '1.39 Cr',
       '11.52 Lakh', '13.23 Lakh', '10.06 Lakh', '15.34 Lakh',
       '24.01 Lakh', '11.39 Lakh', '9.79 Lakh', '35 Lakh', '9.26 Lakh',
       '8.68 Lakh', '66.39 Lakh', '36.45 Lakh', '91.38 Lakh',
       '53.41 Lakh', '4.59 Lakh', '67.87 Lakh', '9.44 Lakh', '48.64 Lakh',
       '11.69 Lakh', '11.11 Lakh', '6.33 Lakh', '8.1 Lakh', '6.4 Lakh',
       '7.59 Lakh', '7 Lakh', '7.43 Lakh', '22.43 Lakh', '24.02 Lakh',
       '21.69 Lakh', '34.63 Lakh', '43.31 Lakh', '4.71 Lakh', '1.02 Cr',
       '6.71 Lakh', '34.45 Lakh', '8.58 Lakh', '12.67 Lakh', '11.89 Lakh',
       '10.48 Lakh', '13.59 Lakh', '11.02 Lakh', '41.94 Lakh',
       '8.94 Lakh', '21.38 Lakh', '12.88 Lakh', '8.27 Lakh', '7.37 Lakh',
       '7.33 Lakh', '23.06 Lakh', '1.4 Cr', '5.58 Lakh', '22.46 Lakh',
       '7.69 Lakh', '9.4 Lakh', '6.08 Lakh', '8.36 Lakh', '1.06 Cr',
       '71.15 Lakh', '6.82 Lakh', '8.12 Lakh', '9.78 Lakh', '7.36 Lakh',
       '38.11 Lakh', '11.75 Lakh', '8.44 Lakh', '16.06 Lakh', '6.63 Lakh',
       '1.27 Cr', '39.6 Lakh', '10.91 Lakh', '25.75 Lakh', '5.61 Lakh',
       '8.05 Lakh', '8.82 Lakh', '17.38 Lakh', '5.69 Lakh', '37.51 Lakh',
       '5.88 Lakh', '63.71 Lakh', '11.47 Lakh', '37.46 Lakh', '7.88 Lakh',
       '11.37 Lakh', '11.3 Lakh', '92.5 Lakh', '15.06 Lakh', '39.57 Lakh',
       '13.7 Lakh', '11.16 Lakh', '9.47 Lakh', '10.17 Lakh', '8.17 Lakh',
       '9.58 Lakh', '9.14 Lakh', '64.14 Lakh', '16.36 Lakh', '37.38 Lakh',
       '22.74 Lakh', '33.36 Lakh', '70.55 Lakh', '1.13 Cr', '45.36 Lakh',
       '10.13 Lakh', '14.22 Lakh', '11.77 Lakh', '4.05 Lakh',
       '26.95 Lakh', '4.82 Lakh', '7.17 Lakh', '13.58 Lakh', '9.09 Lakh',
       '4.09 Lakh', '6.83 Lakh', '5.04 Lakh', '43.81 Lakh', '5.12 Lakh',
       '5.71 Lakh', '5.87 Lakh', '8.16 Lakh', '9.72 Lakh', '10.3 Lakh',
       '4.69 Lakh', '5.42 Lakh', '91.23 Lakh', '7.14 Lakh', '69.59 Lakh',
       '4.61 Lakh', '5.3 Lakh', '7.97 Lakh', '59.38 Lakh', '67.1 Lakh',
       '12.22 Lakh', '33.68 Lakh', '6.96 Lakh', '7.96 Lakh', '20.8 Lakh',
       '6.78 Lakh', '19.91 Lakh', '8.93 Lakh', '11.66 Lakh', '7.35 Lakh',
       '6.99 Lakh', '23.89 Lakh', '7.27 Lakh', '8.84 Lakh', '22.37 Lakh',
       '12.02 Lakh', '3.95 Lakh', '48.79 Lakh', '4.66 Lakh', '11.29 Lakh',
       '5.35 Lakh', '1.36 Cr', '6.23 Lakh', '47.16 Lakh', '41.98 Lakh',
       '35.29 Lakh', '7.91 Lakh', '5.36 Lakh', '5.51 Lakh', '20.97 Lakh',
       '34.89 Lakh', '16.4 Lakh', '1.66 Cr', '14.67 Lakh', '12.57 Lakh',
       '9.48 Lakh', '8.95 Lakh', '23.19 Lakh', '8.24 Lakh', '8.71 Lakh',
       '44.75 Lakh', '87.57 Lakh', '8.57 Lakh', '7.56 Lakh', '43.07 Lakh',
       '7.83 Lakh', '6 Lakh', '13.76 Lakh', '14.11 Lakh', '12.47 Lakh',
       '6.51 Lakh', '7.52 Lakh', '15.68 Lakh', '7.45 Lakh', '20.48 Lakh',
       '15.17 Lakh', '8.13 Lakh', '8.79 Lakh', '14.72 Lakh', '25.54 Lakh',
       '16.84 Lakh', '8.28 Lakh', '23.94 Lakh', '69.37 Lakh', '9.04 Lakh',
       '55.07 Lakh', '10.97 Lakh', '21.72 Lakh', '4.9 Lakh', '10.1 Lakh',
       '12.53 Lakh', '20.87 Lakh', '5.9 Lakh', '64.57 Lakh', '17.21 Lakh',
       '6.56 Lakh', '47.2 Lakh', '10.14 Lakh', '1.6 Cr', '5.44 Lakh',
       '26.55 Lakh', '8.26 Lakh', '4.5 Lakh', '56.97 Lakh', '11.19 Lakh',
       '13.33 Lakh', '8.75 Lakh', '21.1 Lakh', '10.28 Lakh', '11.56 Lakh',
       '27.07 Lakh', '4.36 Lakh', '10.81 Lakh', '8.55 Lakh', '22.66 Lakh',
       '4.24 Lakh', '41.02 Lakh', '17 Lakh', '2.3 Cr', '10.89 Lakh',
       '40.62 Lakh', '7.54 Lakh', '30.19 Lakh', '5.56 Lakh', '4.43 Lakh',
       '37.17 Lakh', '12.9 Lakh', '19.18 Lakh', '10.99 Lakh',
       '12.23 Lakh', '11.63 Lakh', '12.27 Lakh', '3.91 Lakh', '44.8 Lakh',
       '50.4 Lakh', '4.04 Lakh', '11.96 Lakh', '11.44 Lakh', '24.63 Lakh',
       '50.26 Lakh', '13.72 Lakh', '23.14 Lakh', '6.29 Lakh', '8.18 Lakh',
       '7.48 Lakh', '83.92 Lakh', '36.94 Lakh', '13.6 Lakh', '10.7 Lakh',
       '4.87 Lakh', '92.79 Lakh', '5.8 Lakh', '62.11 Lakh', '10.83 Lakh',
       '11.05 Lakh', '9.99 Lakh', '14.32 Lakh', '6.21 Lakh', '74.49 Lakh',
       '8.03 Lakh', '1.71 Cr', '37.9 Lakh', '32.54 Lakh', '11.71 Lakh',
       '3.98 Lakh', '4.55 Lakh', '8.8 Lakh', '11.13 Lakh', '11.58 Lakh',
       '10.63 Lakh', '12.68 Lakh', '17.7 Lakh', '14.23 Lakh', '9.62 Lakh',
       '53.14 Lakh', '8.91 Lakh', '10.26 Lakh', '6.94 Lakh', '15.59 Lakh',
       '78.31 Lakh', '42.89 Lakh', '9.56 Lakh', '64.76 Lakh',
       '99.92 Lakh', '69.22 Lakh', '18.45 Lakh', '9.89 Lakh', '7.94 Lakh',
       '8.73 Lakh', '8.69 Lakh', '42.4 Lakh', '23.37 Lakh', '79.78 Lakh',
       '16.6 Lakh', '4.93 Lakh', '14.2 Lakh', '10.42 Lakh', '9.55 Lakh',
       '5.45 Lakh', '8.38 Lakh', '5.95 Lakh', '15.36 Lakh', '10.94 Lakh',
       '10.15 Lakh', '9.83 Lakh', '7.67 Lakh', '9.97 Lakh', '67.67 Lakh',
       '53.68 Lakh', '6.05 Lakh', '10.25 Lakh', '8.23 Lakh', '7.01 Lakh',
       '6.8 Lakh', '25.27 Lakh', '57.3 Lakh', '5.68 Lakh', '9.36 Lakh',
       '38.72 Lakh', '7.7 Lakh', '6.43 Lakh', '5.67 Lakh', '3.96 Lakh',
       '39.27 Lakh', '33.51 Lakh', '15.94 Lakh', '7.15 Lakh', '13.4 Lakh',
       '11.88 Lakh', '21.36 Lakh', '5.92 Lakh', '6.42 Lakh', '8.99 Lakh',
       '12.44 Lakh', '5.77 Lakh', '15.01 Lakh', '40.73 Lakh',
       '33.21 Lakh', '4.45 Lakh', '20.46 Lakh', '39.22 Lakh', '7.77 Lakh',
       '11.91 Lakh', '9.93 Lakh', '9.27 Lakh', '14.95 Lakh', '5.78 Lakh',
       '6.3 Lakh', '5.74 Lakh', '52.96 Lakh', '15.93 Lakh', '3.99 Lakh',
       '1.58 Cr', '6.15 Lakh', '31.93 Lakh', '15.88 Lakh', '7.19 Lakh',
       '56.98 Lakh', '14.13 Lakh', '25.04 Lakh', '8.92 Lakh', '5.01 Lakh',
       '19.01 Lakh', '9.45 Lakh', '3.75 Cr', '35.16 Lakh', '6.24 Lakh',
       '9.42 Lakh', '4.56 Lakh', '29.9 Lakh', '7.12 Lakh', '9.94 Lakh',
       '6.44 Lakh', '16.82 Lakh', '63.47 Lakh', '6.7 Lakh', '34.1 Lakh',
       '5.31 Lakh', '15.24 Lakh', '36.5 Lakh', '37.03 Lakh', '10.86 Lakh',
       '59.12 Lakh', '5.79 Lakh', '10.55 Lakh', '15.73 Lakh',
       '27.56 Lakh', '4.75 Lakh', '7.08 Lakh', '77.92 Lakh', '14.86 Lakh',
       '26.14 Lakh', '32.41 Lakh', '12.05 Lakh', '6.38 Lakh', '5.89 Lakh',
       '6.55 Lakh', '7.79 Lakh', '18.32 Lakh', '16.64 Lakh', '9.54 Lakh',
       '23.29 Lakh', '13.08 Lakh', '4.02 Lakh', '66.71 Lakh',
       '15.11 Lakh', '49.12 Lakh', '10.51 Lakh', '8.65 Lakh', '8.6 Lakh',
       '10.36 Lakh', '20.69 Lakh', '4.25 Lakh', '92.01 Lakh', '7.9 Lakh',
       '7.21 Lakh', '16.94 Lakh', '5.27 Lakh', '11.14 Lakh', '20.01 Lakh',
       '32.62 Lakh', '11.59 Lakh', '6.46 Lakh', '19.72 Lakh',
       '12.46 Lakh', '9.11 Lakh', '5.53 Lakh', '7.06 Lakh', '18.16 Lakh'],
      dtype=object)

In [319]:
def convert_price(value):
    if isinstance(value, str):
        if 'Lakh' in value:
            return float(value.replace('Lakh', '').strip())
        elif 'Cr' in value:
            return float(value.replace('Cr', '').strip()) * 100
    return None

In [321]:
df['New_Price'] = df['New_Price'].apply(convert_price)

In [323]:
df.New_Price.unique()

array([   nan,   8.61,  21.  ,  10.65,  32.01,  47.87,  10.57,  12.33,
        11.12,  23.64,  18.64,  19.34,  49.14,  11.81,  16.65,   6.67,
         6.45,   6.41,  27.  ,   5.13,  54.43,   9.51,   9.96,  14.44,
         4.53,  95.04,  13.49, 128.  ,  60.88,   7.39,  69.47,   8.78,
        12.74,  10.52,  11.98,   8.54,  33.58,   9.12,   5.29,  44.28,
        20.74,  11.74,  25.52,  14.07,  95.13,   8.34,   8.85,  25.4 ,
        16.67,  79.43,   6.62, 104.  ,  58.67,  28.37,   4.48,  72.64,
        36.15,  44.59,  12.  ,  14.65,  53.72,  33.91,  12.51,   9.74,
        95.38,  60.59,  11.28,  11.48,  11.26,  43.65,  62.07,  86.97,
       100.  ,   4.74,  14.84,  49.49,  48.18,  12.34,  15.38,  19.21,
        22.95,  11.15,  10.32,  28.05,  59.77,  15.86,  19.43,  42.12,
        16.95,  15.45,   7.87,   4.7 ,  15.02,  12.56,  11.33,  26.45,
        10.34,   7.46,  11.85,  10.41,   5.57,  42.48,  16.04,   9.1 ,
         7.65,  13.74,   5.72,  21.33,  78.76,   4.29,  10.04,  11.67,
         8.56,   4.78,   6.14,   7.3 ,   4.37,   4.98,  15.29,  24.26,
        75.12,   9.53,  34.6 ,  52.26,  70.43,   4.8 ,  12.12,  19.37,
        12.14,  36.69,  23.68,  55.61,  14.1 ,  13.26,  11.27,  11.2 ,
         9.46,  12.79,  15.57,  19.86,   6.59,   6.54,  26.56,  15.05,
        11.01,  11.  ,   7.55,   7.82,   6.32,  15.14,  15.72,  45.67,
        54.7 ,  22.87,   6.74,  33.09,  23.25,  19.27,  52.77,   7.92,
         7.85,  15.55,  32.45,   4.83,   7.13,  71.82,  50.97,  10.73,
         9.5 ,  52.46,   6.07,   5.54,   4.33,   8.63,   6.68,   7.98,
        24.82,   7.63,  22.86,  11.06,  19.39,  21.77,  18.35,   9.19,
         8.09, 139.  ,  11.52,  13.23,  10.06,  15.34,  24.01,  11.39,
         9.79,  35.  ,   9.26,   8.68,  66.39,  36.45,  91.38,  53.41,
         4.59,  67.87,   9.44,  48.64,  11.69,  11.11,   6.33,   8.1 ,
         6.4 ,   7.59,   7.  ,   7.43,  22.43,  24.02,  21.69,  34.63,
        43.31,   4.71, 102.  ,   6.71,  34.45,   8.58,  12.67,  11.89,
        10.48,  13.59,  11.02,  41.94,   8.94,  21.38,  12.88,   8.27,
         7.37,   7.33,  23.06, 140.  ,   5.58,  22.46,   7.69,   9.4 ,
         6.08,   8.36, 106.  ,  71.15,   6.82,   8.12,   9.78,   7.36,
        38.11,  11.75,   8.44,  16.06,   6.63, 127.  ,  39.6 ,  10.91,
        25.75,   5.61,   8.05,   8.82,  17.38,   5.69,  37.51,   5.88,
        63.71,  11.47,  37.46,   7.88,  11.37,  11.3 ,  92.5 ,  15.06,
        39.57,  13.7 ,  11.16,   9.47,  10.17,   8.17,   9.58,   9.14,
        64.14,  16.36,  37.38,  22.74,  33.36,  70.55, 113.  ,  45.36,
        10.13,  14.22,  11.77,   4.05,  26.95,   4.82,   7.17,  13.58,
         9.09,   4.09,   6.83,   5.04,  43.81,   5.12,   5.71,   5.87,
         8.16,   9.72,  10.3 ,   4.69,   5.42,  91.23,   7.14,  69.59,
         4.61,   5.3 ,   7.97,  59.38,  67.1 ,  12.22,  33.68,   6.96,
         7.96,  20.8 ,   6.78,  19.91,   8.93,  11.66,   7.35,   6.99,
        23.89,   7.27,   8.84,  22.37,  12.02,   3.95,  48.79,   4.66,
        11.29,   5.35, 136.  ,   6.23,  47.16,  41.98,  35.29,   7.91,
         5.36,   5.51,  20.97,  34.89,  16.4 , 166.  ,  14.67,  12.57,
         9.48,   8.95,  23.19,   8.24,   8.71,  44.75,  87.57,   8.57,
         7.56,  43.07,   7.83,   6.  ,  13.76,  14.11,  12.47,   6.51,
         7.52,  15.68,   7.45,  20.48,  15.17,   8.13,   8.79,  14.72,
        25.54,  16.84,   8.28,  23.94,  69.37,   9.04,  55.07,  10.97,
        21.72,   4.9 ,  10.1 ,  12.53,  20.87,   5.9 ,  64.57,  17.21,
         6.56,  47.2 ,  10.14, 160.  ,   5.44,  26.55,   8.26,   4.5 ,
        56.97,  11.19,  13.33,   8.75,  21.1 ,  10.28,  11.56,  27.07,
         4.36,  10.81,   8.55,  22.66,   4.24,  41.02,  17.  , 230.  ,
        10.89,  40.62,   7.54,  30.19,   5.56,   4.43,  37.17,  12.9 ,
        19.18,  10.99,  12.23,  11.63,  12.27,   3.91,  44.8 ,  50.4 ,
         4.04,  11.96,  11.44,  24.63,  50.26,  13.72,  23.14,   6.29,
         8.18,   7.48,  83.92,  36.94,  13.6 ,  10.7 ,   4.87,  92.79,
         5.8 ,  62.11,  10.83,  11.05,   9.99,  14.32,   6.21,  74.49,
         8.03, 171.  ,  37.9 ,  32.54,  11.71,   3.98,   4.55,   8.8 ,
        11.13,  11.58,  10.63,  12.68,  17.7 ,  14.23,   9.62,  53.14,
         8.91,  10.26,   6.94,  15.59,  78.31,  42.89,   9.56,  64.76,
        99.92,  69.22,  18.45,   9.89,   7.94,   8.73,   8.69,  42.4 ,
        23.37,  79.78,  16.6 ,   4.93,  14.2 ,  10.42,   9.55,   5.45,
         8.38,   5.95,  15.36,  10.94,  10.15,   9.83,   7.67,   9.97,
        67.67,  53.68,   6.05,  10.25,   8.23,   7.01,   6.8 ,  25.27,
        57.3 ,   5.68,   9.36,  38.72,   7.7 ,   6.43,   5.67,   3.96,
        39.27,  33.51,  15.94,   7.15,  13.4 ,  11.88,  21.36,   5.92,
         6.42,   8.99,  12.44,   5.77,  15.01,  40.73,  33.21,   4.45,
        20.46,  39.22,   7.77,  11.91,   9.93,   9.27,  14.95,   5.78,
         6.3 ,   5.74,  52.96,  15.93,   3.99, 158.  ,   6.15,  31.93,
        15.88,   7.19,  56.98,  14.13,  25.04,   8.92,   5.01,  19.01,
         9.45, 375.  ,  35.16,   6.24,   9.42,   4.56,  29.9 ,   7.12,
         9.94,   6.44,  16.82,  63.47,   6.7 ,  34.1 ,   5.31,  15.24,
        36.5 ,  37.03,  10.86,  59.12,   5.79,  10.55,  15.73,  27.56,
         4.75,   7.08,  77.92,  14.86,  26.14,  32.41,  12.05,   6.38,
         5.89,   6.55,   7.79,  18.32,  16.64,   9.54,  23.29,  13.08,
         4.02,  66.71,  15.11,  49.12,  10.51,   8.65,   8.6 ,  10.36,
        20.69,   4.25,  92.01,   7.9 ,   7.21,  16.94,   5.27,  11.14,
        20.01,  32.62,  11.59,   6.46,  19.72,  12.46,   9.11,   5.53,
         7.06,  18.16])

In [325]:
df.dropna(inplace=True,ignore_index=True) # here we are going to delete all row in which having nan values

In [327]:
df.New_Price.unique()

array([  8.61,  21.  ,  10.65,  32.01,  47.87,  10.57,  12.33,  11.12,
        23.64,  18.64,  19.34,  49.14,  11.81,  16.65,   6.67,   6.45,
         6.41,  27.  ,   5.13,  54.43,   9.51,   9.96,  14.44,   4.53,
        95.04,  13.49, 128.  ,  60.88,   7.39,  69.47,   8.78,  12.74,
        10.52,  11.98,   8.54,  33.58,   9.12,   5.29,  44.28,  20.74,
        11.74,  25.52,  14.07,  95.13,   8.34,   8.85,  25.4 ,  16.67,
        79.43,   6.62, 104.  ,  58.67,  28.37,   4.48,  72.64,  36.15,
        44.59,  12.  ,  14.65,  53.72,  33.91,  12.51,   9.74,  95.38,
        60.59,  11.28,  11.48,  11.26,  43.65,  62.07,  86.97, 100.  ,
         4.74,  14.84,  49.49,  48.18,  12.34,  15.38,  19.21,  22.95,
        11.15,  10.32,  28.05,  59.77,  15.86,  19.43,  42.12,  16.95,
        15.45,   7.87,   4.7 ,  15.02,  12.56,  11.33,  26.45,  10.34,
         7.46,  11.85,  10.41,   5.57,  42.48,  16.04,   9.1 ,   7.65,
        13.74,   5.72,  21.33,  78.76,   4.29,  10.04,  11.67,   8.56,
         4.78,   6.14,   7.3 ,   4.37,   4.98,  15.29,  24.26,  75.12,
         9.53,  34.6 ,  52.26,  70.43,   4.8 ,  12.12,  19.37,  12.14,
        36.69,  23.68,  55.61,  14.1 ,  13.26,  11.27,  11.2 ,   9.46,
        12.79,  15.57,  19.86,   6.59,   6.54,  26.56,  15.05,  11.01,
        11.  ,   7.55,   7.82,   6.32,  15.14,  15.72,  45.67,  54.7 ,
        22.87,   6.74,  33.09,  23.25,  19.27,  52.77,   7.92,   7.85,
        15.55,  32.45,   4.83,   7.13,  71.82,  50.97,  10.73,   9.5 ,
        52.46,   6.07,   5.54,   4.33,   8.63,   6.68,   7.98,  24.82,
         7.63,  22.86,  11.06,  19.39,  21.77,  18.35,   9.19,   8.09,
       139.  ,  11.52,  13.23,  10.06,  15.34,  24.01,  11.39,   9.79,
        35.  ,   9.26,   8.68,  66.39,  36.45,  91.38,  53.41,   4.59,
        67.87,   9.44,  48.64,  11.69,  11.11,   6.33,   8.1 ,   6.4 ,
         7.59,   7.  ,   7.43,  22.43,  24.02,  21.69,  34.63,  43.31,
         4.71, 102.  ,   6.71,  34.45,   8.58,  12.67,  11.89,  10.48,
        13.59,  11.02,  41.94,   8.94,  21.38,  12.88,   8.27,   7.37,
         7.33,  23.06, 140.  ,   5.58,  22.46,   7.69,   9.4 ,   6.08,
         8.36, 106.  ,  71.15,   6.82,   8.12,   9.78,   7.36,  38.11,
        11.75,   8.44,  16.06,   6.63, 127.  ,  39.6 ,  10.91,  25.75,
         5.61,   8.05,   8.82,  17.38,   5.69,  37.51,   5.88,  63.71,
        11.47,  37.46,   7.88,  11.37,  11.3 ,  92.5 ,  15.06,  39.57,
        13.7 ,  11.16,   9.47,  10.17,   8.17,   9.58,   9.14,  64.14,
        16.36,  37.38,  22.74,  33.36,  70.55, 113.  ,  45.36,  10.13,
        14.22,  11.77,   4.05,  26.95,   4.82,   7.17,  13.58,   9.09,
         4.09,   6.83,   5.04,  43.81,   5.12,   5.71,   5.87,   8.16,
         9.72,  10.3 ,   4.69,   5.42,  91.23,   7.14,  69.59,   4.61,
         5.3 ,   7.97,  59.38,  67.1 ,  12.22,  33.68,   6.96,   7.96,
        20.8 ,   6.78,  19.91,   8.93,  11.66,   7.35,   6.99,  23.89,
         7.27,   8.84,  22.37,  12.02,   3.95,  48.79,   4.66,  11.29,
         5.35, 136.  ,   6.23,  47.16,  41.98,  35.29,   7.91,   5.36,
         5.51,  20.97,  34.89,  16.4 , 166.  ,  14.67,  12.57,   9.48,
         8.95,  23.19,   8.24,   8.71,  44.75,  87.57,   8.57,   7.56,
        43.07,   7.83,   6.  ,  13.76,  14.11,  12.47,   6.51,   7.52,
        15.68,   7.45,  20.48,  15.17,   8.13,   8.79,  14.72,  25.54,
        16.84,   8.28,  23.94,  69.37,   9.04,  55.07,  10.97,  21.72,
         4.9 ,  10.1 ,  12.53,  20.87,   5.9 ,  64.57,  17.21,   6.56,
        47.2 ,  10.14, 160.  ,   5.44,  26.55,   8.26,   4.5 ,  56.97,
        11.19,  13.33,   8.75,  21.1 ,  10.28,  11.56,  27.07,   4.36,
        10.81,   8.55,  22.66,   4.24,  41.02,  17.  , 230.  ,  10.89,
        40.62,   7.54,  30.19,   5.56,   4.43,  37.17,  12.9 ,  19.18,
        10.99,  12.23,  11.63,  12.27,   3.91,  44.8 ,  50.4 ,   4.04,
        11.96,  11.44,  24.63,  50.26,  13.72,  23.14,   6.29,   8.18,
         7.48,  83.92,  36.94,  13.6 ,  10.7 ,   4.87,  92.79,   5.8 ,
        62.11,  10.83,  11.05,   9.99,  14.32,   6.21,  74.49,   8.03,
       171.  ,  37.9 ,  32.54,  11.71,   3.98,   4.55,   8.8 ,  11.13,
        11.58,  10.63,  12.68,  17.7 ,  14.23,   9.62,  53.14,   8.91,
        10.26,   6.94,  15.59,  78.31,  42.89,   9.56,  64.76,  99.92,
        69.22,  18.45,   9.89,   7.94,   8.73,   8.69,  42.4 ,  23.37,
        79.78,  16.6 ,   4.93,  14.2 ,  10.42,   9.55,   5.45,   8.38,
         5.95,  15.36,  10.94,  10.15,   9.83,   7.67,   9.97,  67.67,
        53.68,   6.05,  10.25,   8.23,   7.01,   6.8 ,  25.27,  57.3 ,
         5.68,   9.36,  38.72,   7.7 ,   6.43,   5.67,   3.96,  39.27,
        33.51,  15.94,   7.15,  13.4 ,  11.88,  21.36,   5.92,   6.42,
         8.99,  12.44,   5.77,  15.01,  40.73,  33.21,   4.45,  20.46,
        39.22,   7.77,  11.91,   9.93])

In [84]:
print(f"Minimum Price: {df['Price'].min()}")
print(f"Maximum Price: {df['Price'].max()}")

Minimum Price: 0.44
Maximum Price: 160.0

In [86]:
# Which year has the highest number of cars listed?

In [116]:
highest_num = df['Year'].value_counts().head()
highest_num

Year
2015    929
2014    925
2016    886
2013    791
2017    709
Name: count, dtype: int64

In [114]:
# Which year has the highest number of cars listed?
highest_num = df['Year'].value_counts().max()
highest_num

929

In [98]:
top_year = df['Year'].value_counts().idxmax()
top_year

2015

In [118]:
# Convert 'Mileage' and 'Power' columns into float values. Write a code snippet for it.

In [120]:
print("\nConverting 'Mileage' and 'Power' to float:")
def convert_mileage_to_float(mileage):
    if isinstance(mileage, str):
        return float(mileage.split(' ')[0])
    return mileage

def convert_power_to_float(power):
    if isinstance(power, str):
        return float(power.split(' ')[0])
    return power

df['Mileage_Float'] = df['Mileage'].apply(convert_mileage_to_float).round(2)
df['Power_Float'] = df['Power'].apply(convert_power_to_float)

print("\nUpdated DataFrame with float Mileage and Power:")
print(df[['Mileage', 'Mileage_Float', 'Power', 'Power_Float']].head())

Converting 'Mileage' and 'Power' to float:

Updated DataFrame with float Mileage and Power:
   Mileage  Mileage_Float   Power  Power_Float
0    26.60          26.60   58.16        58.16
1    19.67          19.67  126.20       126.20
2    18.20          18.20   88.70        88.70
3    20.77          20.77   88.76        88.76
4    15.20          15.20  140.80       140.80

In [122]:
df['Mileage'] = df['Mileage'].astype(float)

In [124]:
df['Power'] = df['Power'].astype(float)

In [126]:
print(df[['Mileage', 'Power']].dtypes)

Mileage    float64
Power      float64
dtype: object

In [411]:
# What is the distribution of transmission types in the dataset?
df['Transmission']

0         Manual
1      Automatic
2         Manual
3         Manual
4      Automatic
         ...
819       Manual
820       Manual
821       Manual
822       Manual
823       Manual
Name: Transmission, Length: 824, dtype: object

In [132]:
print(f"Distribution of transmission types:")
df['Transmission'].value_counts()

Distribution of transmission types:

Transmission
Manual       5204
Automatic    2049
Name: count, dtype: int64

In [142]:
# Find the average selling price of cars by Fuel_Type.
print(f"Average selling price of cars by Fuel_Type:")
df.groupby("Fuel_Type").Price.mean()

Average selling price of cars by Fuel_Type:

Fuel_Type
CNG          3.516786
Diesel      12.840605
Electric    12.875000
LPG          2.487000
Petrol       5.701100
Name: Price, dtype: float64

In [150]:
# Which city has the highest average car price?
print(f"City with the highest average car price:")
df.groupby("Location").Price.mean()

City with the highest average car price:

Location
Ahmedabad      8.457321
Bangalore     13.328631
Chennai        7.753623
Coimbatore    15.078223
Delhi          9.707726
Hyderabad      9.776550
Jaipur         5.809225
Kochi         11.179186
Kolkata        5.661215
Mumbai         9.429329
Pune           6.726254
Name: Price, dtype: float64

In [152]:
df.groupby("Location").Price.mean().idxmax()

'Coimbatore'

In [162]:
# Group the cars by Year and count how many cars were listed each year.
print(f"Number of cars listed each year:")
print(df.groupby("Year").Name.size())
print(df.groupby("Year")["Name"].nunique())

Number of cars listed each year:
Year
1996      1
1998      4
1999      2
2000      5
2001      8
2002     18
2003     20
2004     35
2005     68
2006     89
2007    148
2008    207
2009    252
2010    407
2011    579
2012    690
2013    791
2014    925
2015    929
2016    886
2017    709
2018    361
2019    119
Name: Name, dtype: int64
Year
1996      1
1998      4
1999      2
2000      5
2001      8
2002     16
2003     19
2004     32
2005     52
2006     71
2007    109
2008    153
2009    163
2010    257
2011    332
2012    381
2013    427
2014    477
2015    507
2016    514
2017    447
2018    269
2019    108
Name: Name, dtype: int64

In [166]:
# Calculate the average mileage for each transmission type.
df.groupby("Transmission").Mileage.mean()

Transmission
Automatic    15.759411
Manual       19.079525
Name: Mileage, dtype: float64

In [176]:
# Which car model has the highest average price?
print(f"Car model with the highest average price:")
df.groupby('Name').Price.mean().idxmax()

Car model with the highest average price:

'Land Rover Range Rover 3.0 Diesel LWB Vogue'

In [182]:
# Group by Owner_Type and find the average kilometers driven.
print(f"Average kilometers driven by Owner_Type:")
df.groupby('Owner_Type').Kilometers_Driven.mean()

Average kilometers driven by Owner_Type:

Owner_Type
First              55255.363911
Fourth & Above    119756.500000
Second             72433.625868
Third              87472.729927
Name: Kilometers_Driven, dtype: float64

In [188]:
# What is the average power (bhp) of diesel vs petrol cars?
df.groupby('Fuel_Type').Power.mean()[['Diesel','Petrol']]

Fuel_Type
Diesel    126.949764
Petrol     97.436329
Name: Power, dtype: float64

In [190]:
# Group the cars by 'Fuel_Type' and 'Transmission' and calculate the mean price
df.groupby(['Fuel_Type','Transmission']).Price.mean()

Fuel_Type  Transmission
CNG        Manual           3.516786
Diesel     Automatic       24.583078
           Manual           6.636190
Electric   Automatic       12.875000
LPG        Manual           2.487000
Petrol     Automatic       11.258738
           Manual           4.113947
Name: Price, dtype: float64

In [200]:
# Which Owner_Type has the highest average resale value?
df.groupby('Owner_Type').Price.mean().sort_values(ascending = False).head(1)
# df.groupby('Owner_Type').Price.mean().idxmax()

Owner_Type
First    9.962445
Name: Price, dtype: float64

In [206]:
# For each city, what is the average price of automatic cars?
df[(df.Transmission=='Automatic')].groupby("Location").Price.mean()

Location
Ahmedabad     16.837586
Bangalore     24.237500
Chennai       17.372667
Coimbatore    26.647611
Delhi         20.026725
Hyderabad     21.284439
Jaipur        14.351923
Kochi         21.782488
Kolkata       15.505500
Mumbai        16.042442
Pune          14.505833
Name: Price, dtype: float64